def main():
    # 入力
    n,m = map(int,input().split())
    a = list(map(int,input().split()))
    # 処理
    # 連続部分列の長さmの場合のsum_{i=1}^{M} i × B_iの最大値を求める
    # 連続部分列B=(B_1,B_2,...,B_M)の場合のsum_{i=1}^{M} i × B_iの最大値は、
    # sum_{i=1}^{M} i × B_i = B_1 + B_2 + ... + B_M + (1 + 2 + ... + M) - M
    # なので、B_1 + B_2 + ... + B_Mの最大値を求めれば良い
    # B_1 + B_2 + ... + B_Mの最大値を求める
    # A_1 + A_2 + ... + A_M
    # A_2 + A_3 + ... + A_(M+1)
    # A_3 + A_4 + ... + A_(M+2)
    # ...
    # A_(N-M+1) + A_(N-M+2) + ... + A_N
    # の中で最大値を求めれば良い
    # これは、A_1 + A_2 + ... + A_M
    # A_1 + A_2 + ... + A_M + A_(M+1)
    # A_1 + A_2 + ... + A_M + A_(M+1) + A_(M+2)
    # ...
    # A_1 + A_2 + ... + A_M + A_(M+1) + ... + A_(N-M)
    # A_1 + A_2 + ... + A_M + A_(M+1) + ... + A_(N-M) + A_(N-M+1)
    # ...
    # A_1 + A_2 + ... + A_M + A_(M+1) + ... + A_(N-M) + A_(N-M+1) + ... + A_N
