def main():
    # 標準入力からNを取得する
    n = int(input())
    # 標準入力からHを取得する
    h = list(map(int, input().split()))
    # 計算処理
    # 右隣のマスの高さが今居るマスの高さ以下である限り右隣のマスへ移動し続けます。
    # 最大で何回移動できるでしょうか。
    # 左から i 番目のマスの高さは H_i です。
    # 右隣のマスの高さが今居るマスの高さ以下である限り右隣のマスへ移動し続けます。
    # 最大で何回移動できるでしょうか。
    # 左から i 番目のマスの高さは H_i です。
    # とりあえず、最初のマスに降り立つとして、右隣のマスの高さが今居るマスの高さ以下である限り右隣のマスへ移動し続けます。
    # ということは、右隣のマスの高さが今居るマスの高さ以下でなくなったら、そこで止まる。
    # ということは、右隣のマスの高さが今居るマスの高さ以下でなくなったら、そこで止まる。
    # ということは、右隣のマスの高さが今居るマスの高さ以下でなくなったら、そこで止まる。
    # ということは、右隣のマスの高さが今居るマスの高さ以下でなくなったら、そこで止まる。
    # ということは、右隣のマスの高さが今居るマスの高さ

if __name__ == '__main__':
    main()