def main():
    N = int(input())
    S = [int(i) for i in input().split()]
    T = [int(i) for i in input().split()]
    # すぬけくんの情報
    # 0: 初めて宝石をもらう時刻
    # 1: 宝石をもらった時刻
    # 2: 宝石を渡した時刻
    # 3: 宝石を渡した相手の番号
    # 4: 宝石を渡した相手に渡した時刻
    # 5: 宝石を渡した相手に渡した相手の番号
    # 6: 宝石を渡した相手に渡した相手に渡した時刻
    # 7: 宝石を渡した相手に渡した相手に渡した相手の番号
    # 8: 宝石を渡した相手に渡した相手に渡した相手に渡した時刻
    # 9: 宝石を渡した相手に渡した相手に渡した相手に渡した相手の番号
    # 10: 宝石を渡した相手に渡した相手に渡した相手に渡した相手に渡した時刻
    # 11: 宝石を渡した相手に渡した相手に渡した相手に渡した相手に渡した相手の番号
    # 12: 宝石を渡した相手に渡した相手に渡した相手に渡した相手に渡した相手に渡した時刻
    # 13: 宝石を渡した相手に渡した相手に渡した相手に渡した相手に渡した相手に渡した相手の番号
    # 14: 宝石を渡した相手に

if __name__ == '__main__':
    main()