def main():
    K = int(input())
    # 10進法で表記したときに 0,2 のみからなる正整数のうち、 K 番目に小さいものを求めてください。
    # 10進法で表記した時に 0,2 のみからなる正整数を小さい方から並べると、 2,20,22,... となります。
    # このうち K=3 番目である 22 を出力してください。
    # 10進法で表記した時に 0,2 のみからなる正整数を小さい方から並べると、 2,20,22,... となります。
    # このうち K=11 番目である 2022 を出力してください。
    # 10進法で表記した時に 0,2 のみからなる正整数を小さい方から並べると、 2,20,22,... となります。
    # このうち K=923423423420220108 番目である 220022020000202020002022022000002020002222002200002022002200
    # たとえ答えが大きな整数であっても、求める答えを正確に整数として出力する必要があることに注意してください。
    # 10進法で表記した時に 0,2 のみからなる正整数を小さい方から並べると、 2,20,22,... となります。
    # このうち K=923423423420220108 番目である 220022020000202020002022022000002020002222002200002022002200
    # たとえ答えが大きな整数であっても、求める答えを正確に整数として出力する必要があることに注意してください。
    # 10進法で表記した

if __name__ == '__main__':
    main()