def main():
    N = int(input())
    if N == 1:
        print(0)
        return
    elif N == 2:
        print(1)
        return
    #Nが3以上の時
    #N-1を最大値にする場合は、N-1をNで割った余りは1になる
    #N-2を最大値にする場合は、N-2をNで割った余りは2になる
    #N-3を最大値にする場合は、N-3をNで割った余りは3になる
    #N-4を最大値にする場合は、N-4をNで割った余りは4になる
    #N-5を最大値にする場合は、N-5をNで割った余りは0になる
    #N-6を最大値にする場合は、N-6をNで割った余りは1になる
    #N-7を最大値にする場合は、N-7をNで割った余りは2になる
    #N-8を最大値にする場合は、N-8をNで割った余りは3になる
    #N-9を最大値にする場合は、N-9をNで割った余りは4になる
    #N-10を最大値にする場合は、N-10をNで割った余りは0になる
    #N-11を最大値にする場合は、N-11をNで割った余りは1になる
    #N-12を最大値にする場合は、N-12をNで割った余りは2になる
    #N-13を最大値にする場合は、N-13をNで割った余りは3になる
    #N-14を最大値に

if __name__ == '__main__':
    main()