def main():
    N = int(input())
    A = list(map(int, input().split()))
    mod = 200
    modA = [a%mod for a in A]
    modA = [a+mod if a==0 else a for a in modA]
    #print(modA)
    #print(A)
    #print(N)
    #print(mod)
    #modAの中で、同じ値の要素があるかどうか
    #あったら、その要素を出力する
    #なかったら、modAの中で、同じ値の要素があるかどうかを繰り返す
    #あったら、その要素を出力する
    #なかったら、Noと出力する
    #modAの中で、同じ値の要素があるかどうか
    #あったら、その要素を出力する
    #なかったら、modAの中で、同じ値の要素があるかどうかを繰り返す
    #あったら、その要素を出力する
    #なかったら、Noと出力する
    #modAの中で、同じ値の要素があるかどうか
    #あったら、その要素を出力する
    #なかったら、modAの中で、同じ値の要素があるかどうかを繰り返す
    #あったら、その要素を出力する
    #なかったら、Noと出力する
    #modAの中で、同じ値の要素があるかどうか
    #あったら、その要素を出力する
    #なかったら、modAの中で、同じ値の要素があるかどうかを繰り返す
    #あったら、その要素を出力する
    #なかったら、Noと出力する
    #modAの

if __name__ == '__main__':
    main()