def main():
    # data load
    a, n = map(int, input().split())
    #print(a, n)
    # main
    # 1. aで割り切れるかどうか
    # 2. 10で割り切れるかどうか
    # 3. 1桁かどうか
    # 4. 1桁である場合、その数となるまでの回数
    # 5. 1桁でない場合、その数となるまでの回数
    # 6. 1桁でない場合、その数となるまでの回数
    # 7. 1桁でない場合、その数となるまでの回数
    # 8. 1桁でない場合、その数となるまでの回数
    # 9. 1桁でない場合、その数となるまでの回数
    # 10. 1桁でない場合、その数となるまでの回数
    # 11. 1桁でない場合、その数となるまでの回数
    # 12. 1桁でない場合、その数となるまでの回数
    # 13. 1桁でない場合、その数となるまでの回数
    # 14. 1桁でない場合、その数となるまでの回数
    # 15. 1桁でない場合、その数となるまでの回数
    # 16. 1桁でない場合、その数となるまでの回数
    # 17. 1桁でない場合、その数となるまでの回数
    # 18. 1桁でない場合、その数となるまでの回数
    # 19. 1桁でない場合、その数となるまでの回数

if __name__ == '__main__':
    main()