def main():
    N, L = map(int, input().split())
    # 1個食べるリンゴを選ぶ
    # 1個食べたら、食べていないN-1個のリンゴを材料としてできるアップルパイの味を求める
    # 1個食べるリンゴを選ぶとき、食べていないN-1個のリンゴを材料としてできるアップルパイの味の差の絶対値ができるだけ小さくなるように選ぶ
    # 1個食べるリンゴを選ぶとき、食べていないN-1個のリンゴを材料としてできるアップルパイの味の差の絶対値ができるだけ小さくなるように選ぶということは、
    # 1個食べるリンゴを選ぶとき、食べていないN-1個のリンゴを材料としてできるアップルパイの味の差ができるだけ小さくなるように選ぶということ
    # 1個食べるリンゴを選ぶとき、食べていないN-1個のリンゴを材料としてできるアップルパイの味の差ができるだけ小さくなるように選ぶということは、
    # 1個食べるリンゴを選ぶとき、食べていないN-1個のリンゴを材料としてできるアップルパイの

if __name__ == '__main__':
    main()