def main():
    N, Q = map(int, input().split())
    G = [[] for _ in range(N)]
    for _ in range(N - 1):
        a, b = map(int, input().split())
        G[a - 1].append(b - 1)
        G[b - 1].append(a - 1)
    #print(G)
    # 頂点1を根とする部分木に含まれる頂点の個数を求める
    # 1. 頂点1から順に深さ優先探索する
    # 2. 頂点1から順に、その頂点を根とする部分木に含まれる頂点の個数を求める
    # 3. 頂点1から順に、その頂点を根とする部分木に含まれる頂点の個数を累積和にする
    # 4. 頂点1から順に、その頂点を根とする部分木に含まれる頂点の個数を、その頂点を根とする部分木に含まれる頂点の個数の累積和にする
    # 5. 頂点1から順に、その頂点を根とする部分木に含まれる頂点の個数を、その頂点を根とする部分木に含まれる頂点の個数の累積和の累積和にする
    # 6. 各頂点のカウンターの値を求める
    # 1. 頂点1から順に深さ優先探索する
    # 2. 頂点1から順に、その頂点を根とする部分木に含まれる頂点の個数を求める
    # 3. 頂点1から順に、その頂点を根とする部

if __name__ == '__main__':
    main()