def main():
    # ここに書く
    N = int(input())
    A = int(input())
    B = int(input())
    C = int(input())
    D = int(input())
    E = int(input())
    # 1. 都市1にN人がいる
    # 2. 都市1から2へは電車で1分で移動する。1つの電車にはA人まで乗ることができる。
    # 3. 都市2から3へはバスで1分で移動する。1つのバスにはB人まで乗ることができる。
    # 4. 都市3から4へはタクシーで1分で移動する。1つのタクシーにはC人まで乗ることができる。
    # 5. 都市4から5へは飛行機で1分で移動する。1つの飛行機にはD人まで乗ることができる。
    # 6. 都市5から6へは船で1分で移動する。1つの船にはE人まで乗ることができる。
    # 7. 全員が都市6に到着するまでに最短で何分かかるでしょうか？
    # 8. 乗り継ぎにかかる時間を考える必要はありません。
    # 9. 全員が都市6に移動するのに必要な最小の時間を分単位で出力せよ。
    # 10. 入力は以下の形式で標準入力から与えられる。
    # 11. N
    # 12. A
    # 13. B
    # 14. C
    # 15. D
    # 16. E
    # 17. 1 ≦ N, A, B, C,

if __name__ == '__main__':
    main()