def main():
    N = int(input())
    A = []
    for i in range(N):
        A.append(list(map(int, list(input()))))
    #print(A)
    #上下左右の8方向のうち、右下方向を選ぶ
    #右下方向に進む
    #斜めは考えなくてよい
    #最大値を求める
    #右下方向に進む
    #A[0][0]
    #A[1][1]
    #A[2][2]
    #A[3][3]
    #A[4][4]
    #A[5][5]
    #A[6][6]
    #A[7][7]
    #A[8][8]
    #A[9][9]
    #A[0][1]
    #A[1][2]
    #A[2][3]
    #A[3][4]
    #A[4][5]
    #A[5][6]
    #A[6][7]
    #A[7][8]
    #A[8][9]
    #A[9][0]
    #A[0][2]
    #A[1][3]
    #A[2][4]
    #A[3][5]
    #A[4][6]
    #A[5][7]
    #A[6][8]
    #A[7][9]
    #A[8][0]
    #A[9][1]
    #A[0][3]
    #A[1][4]
    #A[2][5]
    #A[3][6]
    #A[4][7]
    #A[5][8]
    #A[6][9]
    #A[7][0]
    #A[8][1]
    #A[9][2]
    #A[0][4]
    #A[1][5]
    #A[2][6]
    #A[3][7]
    #A[4][8]
    #A[5][9]
    #A[6][0]
    #A[7][1]
    #A[8][2]

if __name__ == '__main__':
    main()