def main():
    N = int(input())
    # 1 以上 2N+1 以下の整数を 1 つずつ宣言します。
    # 先に整数を宣言することが出来なくなった方のプレイヤーの負けとなり、負けなかった方のプレイヤーの勝ちとなります。
    # このゲームでは必ず高橋君が勝ちます。
    # 1 以上 2N+1 以下の整数を 1 つずつ宣言します。
    # 先に整数を宣言することが出来なくなった方のプレイヤーの負けとなり、負けなかった方のプレイヤーの勝ちとなります。
    # このゲームでは必ず高橋君が勝ちます。
    # 1 以上 2N+1 以下の整数を 1 つずつ宣言します。
    # 先に整数を宣言することが出来なくなった方のプレイヤーの負けとなり、負けなかった方のプレイヤーの勝ちとなります。
    # このゲームでは必ず高橋君が勝ちます。
    # 1 以上 2N+1 以下の整数を 1 つずつ宣言します。
    # 先に整数を宣言することが出来なくなった方のプレイヤーの負けとなり、負けなかった方のプレイヤーの勝ちとなります。
    # このゲームでは必ず高橋君が勝ちます。
    # 1 以上 2N+1 以下の整数を 1 つずつ宣言します。
    #
