def main():
    N = int(input())
    # 99を超えると10桁になるので、それまでの数値を計算する
    # 1桁目は2桁目と同じ数値、2桁目は3桁目と同じ数値・・・となる
    # 1桁目は1,2,3,4,5,6,7,8,9の9通り
    # 2桁目は1,2,3,4,5,6,7,8,9の9通り
    # 3桁目は1,2,3,4,5,6,7,8,9の9通り
    # 4桁目は1,2,3,4,5,6,7,8,9の9通り
    # 5桁目は1,2,3,4,5,6,7,8,9の9通り
    # 6桁目は1,2,3,4,5,6,7,8,9の9通り
    # 7桁目は1,2,3,4,5,6,7,8,9の9通り
    # 8桁目は1,2,3,4,5,6,7,8,9の9通り
    # 9桁目は1,2,3,4,5,6,7,8,9の9通り
    # 10桁目は1,2,3,4,5,6,7,8,9の9通り
    # 11桁目は1,2,3,4,5,6,7,8,9の9通り
    # 12桁目は1,2,3,4,5,6,7,8,9の9通り
    # 13桁目は1,2,3,4,5,6,7,8,9の9通り
    # 14桁目は1,2,3,4,5,6,7,8,9の9通り
    #
