def main():
    #问题陈述
    #高桥成为了一名糕点师，为了庆祝AtCoder初级竞赛100强，他开了一家商店La Confiserie d'ABC。
    #该店出售N种蛋糕。
    #每种蛋糕有三个参数 "美丽"、"美味 "和 "受欢迎"。第i种蛋糕的美丽度为x_i，美味度为y_i，受欢迎度为z_i。
    #这些值可能是零或负值。
    #Ringo已经决定在这里吃M块蛋糕。他将按以下方式选择蛋糕的集合：
    #不要有两块或两块以上相同种类的蛋糕。
    #在上述条件下，选择一组蛋糕，使（总美丽度的绝对值）+（总美味度的绝对值）+（总受欢迎程度的绝对值）最大化。
    #找出Ringo选择的这组蛋糕的（总美丽度的绝对值）+（总美味度的绝对值）+（总受欢迎程度的绝对值）的最大可能值。
    #
    #约束条件
    #N是1到1 000（包括）之间的整数。
    #M是0到N之间的一个整数（包括）。
    #x_i, y_i, z_i (1 ≦ i ≦ N)是介于-10 000 000和10 000 000（包括）之间的整数。
    #
    #输入
    #输入来自标准输入，其格式如下：
    #N M
    #X_1 Y_1 Z_1
    #x_2 y_2 z_2
    #

if __name__ == '__main__':
    main()