def main():
    N, K = map(int, input().split())
    P = list(map(int, input().split()))
    C = list(map(int, input().split()))
    #print(N, K)
    #print(P)
    #print(C)
    #print()
    #print()
    #print()
    # 1. 0 から始める場合
    # 2. 1 から始める場合
    # 3. 2 から始める場合
    # 4. 3 から始める場合
    # 5. 4 から始める場合
    # 6. 5 から始める場合
    # 7. 6 から始める場合
    # 8. 7 から始める場合
    # 9. 8 から始める場合
    # 10. 9 から始める場合
    # 11. 10 から始める場合
    # 12. 11 から始める場合
    # 13. 12 から始める場合
    # 14. 13 から始める場合
    # 15. 14 から始める場合
    # 16. 15 から始める場合
    # 17. 16 から始める場合
    # 18. 17 から始める場合
    # 19. 18 から始める場合
    # 20. 19 から始める場合
    # 21. 20 から始める場合
    # 22. 21 から始める場合
    # 23. 22 から始める場合
    # 24. 23 から始める場合
    # 25. 24 から始める場合
    # 26. 25 から始める場合
    # 27. 26 から始める場合
    # 28. 27 から始める場合
    # 29. 28 から始める場合
