def main():
    n = int(input())
    a = list(map(int, input().split()))
    b = list(map(int, input().split()))
    c = [int(i) - 1 for i in input().split()]
    #print(n)
    #print(a)
    #print(b)
    #print(c)
    #cについて、bの要素をkeyにして、valueをindexにした辞書を作る
    #c = [0,1,1]の時、{1:0,2:1,2:2}となる
    #c = [1,2,2]の時、{1:0,2:1,2:2}となる
    #c = [2,3,2]の時、{2:0,3:1,2:2}となる
    #この辞書を使って、aとbの組み合わせを数える
    #a = [1,2,2],b = [3,1,2]の時、{1:0,2:1,2:2}となる
    #a = [2,3,2],b = [1,2,2]の時、{1:0,2:1,2:2}となる
    #a = [2,3,2],b = [2,3,2]の時、{2:0,3:1,2:2}となる
    #a = [1,1,1,1],b = [1,1,1,1]の時、{1:0,1:1,1:2,1:3}となる
    #a = [1,1,1,1],b = [1,1,1,1]の時、{1:0,1:1,1:2,1:3}となる
    #a = [1,2,3,4],b = [1,1,1,1]の時、{1:0,1:1,1:2,1:3}となる
    #a = [2,3,3],b = [1,3,3]
