def main():
    N, K = map(int, input().split())
    A = list(map(int, input().split()))
    # 2進数で考える
    # Kの最上位ビット1桁目の値を求める
    # Kの最上位ビット1桁目が1なら、Kの最上位ビット1桁目を0にした値を求める
    # Kの最上位ビット1桁目が0なら、Kの最上位ビット1桁目を1にした値を求める
    # Kの最上位ビット2桁目の値を求める
    # Kの最上位ビット2桁目が1なら、Kの最上位ビット2桁目を0にした値を求める
    # Kの最上位ビット2桁目が0なら、Kの最上位ビット2桁目を1にした値を求める
    # Kの最上位ビット3桁目の値を求める
    # Kの最上位ビット3桁目が1なら、Kの最上位ビット3桁目を0にした値を求める
    # Kの最上位ビット3桁目が0なら、Kの最上位ビット3桁目を1にした値を求める
    # Kの最上位ビット4桁目の値を求める
    # Kの最上位ビット4桁目が1なら、Kの最上位ビット4桁目を0にした値を求める
    # Kの最上位ビット4桁目が0なら、Kの最上位ビット4桁目を1にした値を求める
    # Kの最上位ビット5桁目の値を求める
    # Kの最上位ビット5桁目が1なら、Kの最上位ビット5桁目を0にした値を求め

if __name__ == '__main__':
    main()