def main():
    M = int(input())
    u = [0] * M
    v = [0] * M
    for i in range(M):
        u[i], v[i] = map(int, input().split())
    p = list(map(int, input().split()))
    # print(M)
    # print(u)
    # print(v)
    # print(p)
    # 1. 8個のピースがそれぞれ、1-8の頂点にあるかを確認
    # 2. 1-8の頂点がそれぞれ、1-8のピースにあるかを確認
    # 3. 1-8の頂点がそれぞれ、1-8のピースにあるかを確認
    # 4. 1-8の頂点がそれぞれ、1-8のピースにあるかを確認
    # 5. 1-8の頂点がそれぞれ、1-8のピースにあるかを確認
    # 6. 1-8の頂点がそれぞれ、1-8のピースにあるかを確認
    # 7. 1-8の頂点がそれぞれ、1-8のピースにあるかを確認
    # 8. 1-8の頂点がそれぞれ、1-8のピースにあるかを確認
    # 1. 8個のピースがそれぞれ、1-8の頂点にあるかを確認
    # 2. 1-8の頂点がそれぞれ、1-8のピースにあるかを確認
    # 3. 1-8の頂点がそれぞれ、1-8のピースにあるかを確認
    # 4. 1-8の頂点がそれぞれ、1-8のピースにあるかを確認

if __name__ == '__main__':
    main()