def solve():
    # === 数値を取得 ===
    S = input()
    # === 文字列を取得 ===
    # === 行列を取得 ===
    # === 複数行の整数を取得 ===
    # === 複数行の文字列を取得 ===
    # === 複数行の行列を取得 ===
    # === 複数行の複数行の整数を取得 ===
    # === 複数行の複数行の文字列を取得 ===
    # === 複数行の複数行の行列を取得 ===
    # === 複数行の複数行の複数行の整数を取得 ===
    # === 複数行の複数行の複数行の文字列を取得 ===
    # === 複数行の複数行の複数行の行列を取得 ===
    # === 処理 ===
    for i in range(0, len(S)):
        if i % 2 == 0:
            if S[i] == "L":
                print("No")
                return
        else:
            if S[i] == "R":
                print("No")
                return
    print("Yes")
