def main():
    N = int(input())
    # 1日目の朝に1円入れる
    # 2日目の朝に2円入れる
    # 3日目の朝に3円入れる
    # 4日目の朝に4円入れる
    # 5日目の朝に5円入れる
    # 6日目の朝に6円入れる
    # 7日目の朝に7円入れる
    # 8日目の朝に8円入れる
    # 9日目の朝に9円入れる
    # 10日目の朝に10円入れる
    # 11日目の朝に11円入れる
    # 12日目の朝に12円入れる
    # 13日目の朝に13円入れる
    # 14日目の朝に14円入れる
    # 15日目の朝に15円入れる
    # 16日目の朝に16円入れる
    # 17日目の朝に17円入れる
    # 18日目の朝に18円入れる
    # 19日目の朝に19円入れる
    # 20日目の朝に20円入れる
    # 21日目の朝に21円入れる
    # 22日目の朝に22円入れる
    # 23日目の朝に23円入れる
    # 24日目の朝に24円入れる
    # 25日目の朝に25円入れる
    # 26日目の朝に26円入れる
    # 27日目の朝に27円入れる
    # 28日目の朝に28円入れる
    # 29日目の朝に29円入れる
    # 30日目の朝に30円入れる
    # 31日目の朝に31円

if __name__ == '__main__':
    main()