def main():
    #入力
    N, K = map(int, input().split())
    A = list(map(int, input().split()))
    #処理
    #Aを昇順に並べ替えることが出来るかどうかを判定してください
    #あなたは次の操作を 0 回以上何度でも行えます。
    #1 ≦ i ≦ N-K を満たす整数 i を選び、a_i と a_{i+K} の値を入れ替える。
    #A を昇順に並べ替えることが出来るかどうかを判定してください。
    #Aを昇順に並べ替えることが出来るかどうかを判定してください
    #あなたは次の操作を 0 回以上何度でも行えます。
    #1 ≦ i ≦ N-K を満たす整数 i を選び、a_i と a_{i+K} の値を入れ替える。
    #A を昇順に並べ替えることが出来るかどうかを判定してください。
    #Aを昇順に並べ替えることが出来るかどうかを判定してください
    #あなたは次の操作を 0 回以上何度でも行えます。
    #1 ≦ i ≦ N-K を満たす整数 i を選び、a_i と a_{i+K} の値を入れ替える。
    #A を昇順に並べ替えることが出来るかどうかを判定してください。
    #Aを昇順に並べ替えることが出来るかどうかを判定してください
    #あなたは次の操作を 0 回以上何度でも行えます。
    #1

if __name__ == '__main__':
    main()