def main():
    N = int(input())
    A = list(map(int,input().split()))
    #N=4のときは、A[0]とA[1]を分ける、A[1]とA[2]を分ける、A[2]とA[3]を分けるの3通り
    #N=5のときは、A[0]とA[1]を分ける、A[1]とA[2]を分ける、A[2]とA[3]を分ける、A[3]とA[4]を分けるの4通り
    #N=6のときは、A[0]とA[1]を分ける、A[1]とA[2]を分ける、A[2]とA[3]を分ける、A[3]とA[4]を分ける、A[4]とA[5]を分けるの5通り
    #N=7のときは、A[0]とA[1]を分ける、A[1]とA[2]を分ける、A[2]とA[3]を分ける、A[3]とA[4]を分ける、A[4]とA[5]を分ける、A[5]とA[6]を分けるの6通り
    #N=8のときは、A[0]とA[1]を分ける、A[1]とA[2]を分ける、A[2]とA[3]を分ける、A[3]とA[4]を分ける、A[4]とA[5]を分ける、A[5]とA[6]を分ける、A[6]とA[7]を分けるの7通り
    #N=9のときは、A[0]とA[1]を分ける、A[1]とA[2]を分ける、A[2]とA[3]を分ける、A[3]とA[4]を

if __name__ == '__main__':
    main()