def main():
    N = int(input())
    #N以下の正の整数の組(A,B)の個数を求める
    #A,Bを先頭に0のつかない10進数表記で表したときに、
    #Aの末尾の桁がBの先頭の桁に等しく、Aの先頭の桁がBの末尾の桁に等しい
    #A,Bの桁数は同じ
    #Nは10^5以下
    #A,BはN以下
    #N=1のときは1
    #N=2のときは1
    #N=3のときは2
    #N=4のときは3
    #N=5のときは4
    #N=6のときは5
    #N=7のときは6
    #N=8のときは7
    #N=9のときは8
    #N=10のときは9
    #N=11のときは9
    #N=12のときは10
    #N=13のときは11
    #N=14のときは12
    #N=15のときは13
    #N=16のときは14
    #N=17のときは15
    #N=18のときは16
    #N=19のときは17
    #N=20のときは18
    #N=21のときは18
    #N=22のときは19
    #N=23のときは20
    #N=24のときは21
    #N=25のときは22
    #N=26のときは23
    #N=27のときは24
    #N=28のときは25
    #N=29のときは26
    #N=30のときは27
    #N=31のときは27
    #N=32のときは28
    #N=33のときは29

if __name__ == '__main__':
    main()