def main():
    n = int(input())
    a = list(map(int, input().split()))
    # print(n, a)
    # 10个数，每个数的个数
    cnt = [0] * 10
    for i in a:
        cnt[i] += 1
    # print(cnt)
    # 逆向思维，最后的结果是K，那么最开始的数是几，就有几种可能
    # 从大到小，一共10种可能
    for k in range(10):
        ans = 0
        # 前面的数，从大到小
        for i in range(10):
            # 后面的数，从大到小
            for j in range(10):
                # i 和 j 的可能性
                # i + j = k
                # 9 + 1 = 10
                # 8 + 2 = 10
                # 7 + 3 = 10
                # 6 + 4 = 10
                # 5 + 5 = 10
                # 4 + 6 = 10
                # 3 + 7 = 10
                # 2 + 8 = 10
                # 1 + 9 = 10
                # 0 + 0 = 0
                # i * j = k
                # 9 * 1 = 9
                # 8 * 2 = 16
                # 7 * 3 = 21
                # 6 * 4 = 24
                # 5 * 5 = 25
                # 4 * 6 = 24
                # 3 * 7 = 21
                # 2 * 8 = 16
                # 1 * 9 = 9
                # 0 * 0 = 0
                # 9 + 1 = 10
                # 8 + 2 = 10
                # 7 + 3 = 10
                # 6 + 4 = 10
                # 5 + 5 = 10
                # 4 + 6 = 10
                # 3 + 7 = 10
                #

if __name__ == '__main__':
    main()