def main():
    N, K = map(int, input().split())
    sushi = []
    for i in range(N):
        t, d = map(int, input().split())
        sushi.append((t, d))
    sushi.sort(key=lambda x: x[1], reverse=True)
    # 前処理
    # 各ネタが何個あるかを記録しておく
    # 前から順に見ていくので、あるネタが何個あるかは、
    # そのネタの寿司に到達した時点で、そのネタの個数を記録する
    # そのネタの個数が2個目以降であれば、そのネタを食べることができる
    # また、そのネタの個数が2個目以降であれば、そのネタを食べた時の
    # 「種類ボーナスポイント」は、そのネタの個数を1つ減らした値の2乗である
    # また、そのネタの個数が2個目以降であれば、そのネタを食べた時の
    # 「おいしさ基礎ポイント」は、そのネタのおいしさである
    # なお、そのネタの個数が1個しかなければ、そのネタを食べることはできない
    # また、そのネタの個数が1個しかなければ、そのネタを食べた時の
    # 「種類ボーナスポイント」は、0 である
    # また、そのネタの個数が1個しかなければ、そのネタを食べた時の
    # 「おいしさ基礎ポイント」は、

if __name__ == '__main__':
    main()