def main():
    N = int(input())
    A = list(map(int, input().split()))
    # print(N)
    # print(A)
    # count = 0
    # for i in range(N):
    #     for j in range(i+1, N):
    #         if (A[i]-A[j])%200 == 0:
    #             count += 1
    # print(count)
    # 200的倍数，只有两种情况，一种是末尾两个数字相等，一种是末尾两个数字相加等于200
    # 1. 末尾两个数字相等
    # 2. 末尾两个数字相加等于200
    # 3. 末尾两个数字相加等于400
    # 4. 末尾两个数字相加等于600
    # 5. 末尾两个数字相加等于800
    # ...
    # 100个
    # 1. 末尾两个数字相等
    # 2. 末尾两个数字相加等于200
    # 3. 末尾两个数字相加等于400
    # 4. 末尾两个数字相加等于600
    # 5. 末尾两个数字相加等于800
    # ...
    # 100个
    # 1. 末尾两个数字相等
    # 2. 末尾两个数字相加等于200
    # 3. 末尾两个数字相加等于400
    # 4. 末尾两个数字相加等于600
    # 5. 末尾两个数字相加等于800
    # ...
    # 100个
    # 1. 末尾两个数字相等
    # 2. 末尾两个数字相加等于200
    # 3. 末尾两个数字相加等于400
    # 4. 末尾两

if __name__ == '__main__':
    main()