def main():
    #入力
    S = input()
    #初期化
    #Sのi文字目をS_iで表す
    #S_iが英小文字ならば、その英小文字が書かれたボールを箱に入れる。ただし、そのボールがすでに箱に入っている場合、高橋君は気を失う。
    #S_iが(ならば、何もしない。
    #S_iが)ならば、i 未満の整数 j であって、S の j 番目から i 番目までの文字からなる文字列が良い文字列となる最大の整数 j を取る。（このような整数 j は必ず存在することが証明できる。）j 番目から i 番目までの操作で箱に入れたボールをすべて、箱から取り出す。
    #高橋君が気を失わずに一連の操作を完了させられるか判定してください。
    #制約
    #1 ≦ |S| ≦ 3 × 10^5
    #S は良い文字列
    #Sのi文字目をS_iで表す
    #S_iが英小文字ならば、その英小文字が書かれたボールを箱に入れる。ただし、そのボールがすでに箱に入っている場合、高橋君は気を失う。
    #S_iが(ならば、何もしない。
    #S_iが)ならば、i 未満の整数 j であって、S の j 番目から i 番目までの文字からなる文字列が良い文字列となる最大の整数 j を取る。（このような整数 j は必ず存在することが証明できる。）j 番目から i
