def main():
    N = int(input())
    X = []
    Y = []
    for i in range(N):
        x,y = map(int,input().split())
        X.append(x)
        Y.append(y)
    S = input()
    #print(N)
    #print(X)
    #print(Y)
    #print(S)
    #X[i]とY[i]の組が一致するときには、S[i]とS[i+1]が同じでなければならない
    #X[i]とY[i]の組が一致しないときには、S[i]とS[i+1]が同じであればならない
    #X[i]とY[i]の組が一致するときには、S[i]とS[i+1]が同じでなければならない
    #X[i]とY[i]の組が一致しないときには、S[i]とS[i+1]が同じであればならない
    #X[i]とY[i]の組が一致するときには、S[i]とS[i+1]が同じでなければならない
    #X[i]とY[i]の組が一致しないときには、S[i]とS[i+1]が同じであればならない
    #X[i]とY[i]の組が一致するときには、S[i]とS[i+1]が同じでなければならない
    #X[i]とY[i]の組が一致しないときには、S[i]とS[i+1]が同じであればならない
    #X[i]とY[i]の組が一致するときには、S[i]とS[i+1]が同じでなければならない
    #X[i]とY[i]の組が一致しないときには、S[i]とS[i+1
