def main():
    N, M = map(int, input().split())
    K = []
    A = []
    for i in range(M):
        K.append(int(input()))
        A.append(list(map(int, input().split())))
    print(N, M)
    print(K)
    print(A)
    # ここに書く
    # 1つ目の筒と2つ目の筒を選び、それぞれの筒の一番上にあるボールを取り出して捨てる。
    # 捨てられるボールの色は共に1であり等しいので、この操作は有効である。
    # 1つ目の筒と2つ目の筒を選び、それぞれの筒の一番上にあるボールを取り出して捨てる。
    # 捨てられるボールの色は共に2であり等しいので、この操作は有効である。
    # 1つ目の筒と2つ目の筒を選び、それぞれの筒の一番上にあるボールを取り出して捨てる。
    # 捨てられるボールの色は共に2であり等しいので、この操作は有効である。
    # 1つ目の筒と2つ目の筒を選び、それぞれの筒の一番上にあるボールを取り出して捨てる。
    # 捨てられるボールの色は共に1であり等しいので、この操作は有効である。
    # 1つ目の筒と2つ目の筒を選び、それぞれの筒の一番上にあるボールを取り出して捨てる。
    # 捨てられるボールの色は共に1であり等しいので、この操作は有効である。
    # 1つ

if __name__ == '__main__':
    main()