def main():
    X = input()
    M = int(input())
    if len(X) == 1:
        if int(X) <= M:
            print(1)
        else:
            print(0)
        return
    # Xをn進法表記とみなして得られる値のうちM以下であるようなものは何種類あるか
    # Xをn進法表記とみなして得られる値のうちM以下であるようなものは何種類あるか
    # Xをn進法表記とみなして得られる値のうちM以下であるようなものは何種類あるか
    # Xをn進法表記とみなして得られる値のうちM以下であるようなものは何種類あるか
    # Xをn進法表記とみなして得られる値のうちM以下であるようなものは何種類あるか
    # Xをn進法表記とみなして得られる値のうちM以下であるようなものは何種類あるか
    # Xをn進法表記とみなして得られる値のうちM以下であるようなものは何種類あるか
    # Xをn進法表記とみなして得られる値のうちM以下であるようなものは何種類あるか
    # Xをn進法表記とみなして得られる値のうちM以下であるようなものは何種類あるか
    # Xをn進法表記とみなして得られる値のうちM以下であるようなものは何種類あるか
    # Xをn進法表記とみなして得られる値のうちM

if __name__ == '__main__':
    main()