def main():
    N, M = map(int, input().split())
    S = []
    for _ in range(N):
        S.append(input())
    # 2人の参加者でペアを組んで参加
    # 二人が協力することで M 問全てを解くことが可能であるようなペアの個数を答える
    # 1≦ x < y≦ N を満たす整数の組 (x,y) であって、
    # 1 以上 M 以下の任意の整数 j について、参加者 x か参加者 y の少なくとも一方は問題 j を解くことが可能であるという条件を満たすものの個数を答える
    # 2人の参加者でペアを組んで参加
    # 二人が協力することで M 問全てを解くことが可能であるようなペアの個数を答える
    # 1≦ x < y≦ N を満たす整数の組 (x,y) であって、
    # 1 以上 M 以下の任意の整数 j について、参加者 x か参加者 y の少なくとも一方は問題 j を解くことが可能であるという条件を満たすものの個数を答える
    # 2人の参加者でペアを組んで参加
    # 二人が協力することで M 問全てを解くことが可能であるようなペアの個数を答える
    # 1≦ x < y≦ N を満たす整数の組 (x,y) であって、
    # 1 以上 M 以下の任意の整数 j について、参加者 x か参加者 y の少な

if __name__ == '__main__':
    main()