def main():
    N = int(input())
    A = list(map(int, input().split()))
    Q = int(input())
    query = [list(map(int, input().split())) for _ in range(Q)]
    # 1 x
    # 2 i x
    # 3 i
    # 1 x を実行するときにxを保存しておく
    # 2 i x を実行するときにi, xを保存しておく
    # 3 i を実行するときにiを保存しておく
    # 1 x を実行した時に、2 i x を実行した回数を保存しておく
    # 2 i x を実行した時に、2 i x を実行した回数を保存しておく
    # 3 i を実行した時に、2 i x を実行した回数を保存しておく
    # 1 x を実行した時に、2 i x を実行した回数を保存しておく
    # 2 i x を実行した時に、2 i x を実行した回数を保存しておく
    # 3 i を実行した時に、2 i x を実行した回数を保存しておく
    # 1 x を実行した時に、2 i x を実行した回数を保存しておく
    # 2 i x を実行した時に、2 i x を実行した回数を保存しておく
    # 3 i を実行した時に、2 i x を実行した回数を保存しておく
    # 1 x を実行した時に、2 i x を実行した回数を保存しておく
    # 2 i x を実行した時に、2 i x を実行した回数を保存しておく
    # 3 i を実行した時に、2 i x を実行した回数を保存しておく
    # 1 x を実行した時に、2 i x を実行した回数

if __name__ == '__main__':
    main()