def solution(n):
    # 1. 从 1 开始，累乘 6，直到大于 n
    # 2. 从 1 开始，累乘 9，直到大于 n
    # 3. 从 1 开始，累乘 36，直到大于 n
    # 4. 从 1 开始，累乘 81，直到大于 n
    # 5. 从 1 开始，累乘 216，直到大于 n
    # 6. 从 1 开始，累乘 729，直到大于 n
    # 7. 从 1 开始，累乘 1296，直到大于 n
    # 8. 从 1 开始，累乘 6561，直到大于 n
    # 9. 从 1 开始，累乘 7776，直到大于 n
    # 10. 从 1 开始，累乘 46656，直到大于 n
    # 11. 从 1 开始，累乘 59049，直到大于 n
    # 12. 从 1 开始，累乘 279936，直到大于 n
    # 13. 从 1 开始，累乘 531441，直到大于 n
    # 14. 从 1 开始，累乘 1679616，直到大于 n
    # 15. 从 1 开始，累乘 4782969，直到大于 n
    # 16. 从 1 开始，累乘 14348907，直到大于 n
    # 17. 从 1 开始，累乘 43046721，直到大于 n
    # 18. 从 1 开始，累乘 129140163，直到大于 n
    # 19. 从 1 开始，累乘 387420489，直到大于 n
    #
