def main():
    n, m = map(int, input().split())
    a = []
    b = []
    for i in range(m):
        ai, bi = map(int, input().split())
        a.append(ai)
        b.append(bi)
    # 从西边连接第i个岛和从西边连接第（i+1）个岛
    # 从西边连接第a_i个岛和从西边连接第b_i个岛
    # 1 2 3 4 5
    # 1 4
    # 2 5
    # 1和4之间有桥梁，2和5之间有桥梁
    # 1和4之间有桥梁，1和5之间有桥梁
    # 1和4之间有桥梁，2和4之间有桥梁
    # 1和4之间有桥梁，2和5之间有桥梁
    # 1和4之间有桥梁，3和4之间有桥梁
    # 1和4之间有桥梁，3和5之间有桥梁
    # 1和4之间有桥梁，4和5之间有桥梁
    # 2和5之间有桥梁，1和5之间有桥梁
    # 2和5之间有桥梁，2和4之间有桥梁
    # 2和5之间有桥梁，2和5之间有桥梁
    # 2和5之间有桥梁，3和4之间有桥梁
    # 2和5之间有桥梁，3和5之间有桥梁
    # 2和5之间有桥梁，4和5之间有桥梁
    # 1和2之间有桥梁
