def main():
    #输入
    p = int(input())
    #处理
    #用10元硬币支付
    #用9个10元硬币支付
    #用8个10元硬币支付
    #...
    #用1个10元硬币支付
    #用0个10元硬币支付
    #用9个10元硬币和1个1元硬币支付
    #用9个10元硬币和2个1元硬币支付
    #...
    #用9个10元硬币和9个1元硬币支付
    #用8个10元硬币和1个1元硬币支付
    #用8个10元硬币和2个1元硬币支付
    #...
    #用8个10元硬币和9个1元硬币支付
    #...
    #用1个10元硬币和1个1元硬币支付
    #用1个10元硬币和2个1元硬币支付
    #...
    #用1个10元硬币和9个1元硬币支付
    #用0个10元硬币和1个1元硬币支付
    #用0个10元硬币和2个1元硬币支付
    #...
    #用0个10元硬币和9个1元硬币支付
    #用9个10元硬币和1个2元硬币支付
    #用9个10元硬币和2个2元硬币支付
    #...
    #用9个10元硬币和4个2元硬币支付
    #...
    #用8个10元硬币和1个2元硬币支付
    #用8个10元硬币和2个2元硬币支付
    #...
    #用8个10元硬币和4个2元硬币

if __name__ == '__main__':
    main()