def main():
    # 入力
    A=int(input())
    B=int(input())
    C=int(input())
    D=int(input())
    E=int(input())
    # 処理
    # ABC 丼→ARC カレー→AGC パスタ→ATC ハンバーグ→APC ラーメンの順に注文することにする
    # 時刻 0 に ABC 丼を注文する。時刻 29 に ABC 丼が届く。
    # 時刻 30 に ARC カレーを注文する。時刻 50 に ARC カレーが届く。
    # 時刻 50 に AGC パスタを注文する。57 に AGC パスタが届く。
    # 時刻 60 に ATC ハンバーグを注文する。時刻 180 に ATC ハンバーグが届く。
    # 時刻 180 に APC ラーメンを注文する。時刻 215 に APC ラーメンが届く。
    # 時刻 215 に ABC 丼を注文する。時刻 244 に ABC 丼が届く。
    # 時刻 245 に ARC カレーを注文する。時刻 265 に ARC カレーが届く。
    # 時刻 265 に AGC パスタを注文する。時刻 272 に AGC パスタが届く。
    # 時刻 280 に ATC ハンバーグを注文する。時刻 400 に ATC ハンバーグが届く。
    # 時刻 400 に APC ラーメンを注文する。時刻 435 に APC ラーメンが届く。
    # 時刻 435 に ABC 丼を注文する。時刻 464 に ABC 丼が
