def main():
    N = int(input())
    S = input()
    # print(N)
    # print(S)
    # 1. AとBはR, G, Bのどれか
    # 2. AとBの距離は2以上である
    # 3. AとBは異なる文字である
    # 4. BとCはR, G, Bのどれか
    # 5. BとCの距離は2以上である
    # 6. BとCは異なる文字である
    # 7. AとCはR, G, Bのどれか
    # 8. AとCは異なる文字である
    # 9. BとCは異なる文字である
    # 10. AとBの距離はBとCの距離と異なる
    # 11. AとCの距離はBとCの距離と異なる
    # 1. AとBはR, G, Bのどれか
    # 2. AとBの距離は2以上である
    # 3. AとBは異なる文字である
    # 4. BとCはR, G, Bのどれか
    # 5. BとCの距離は2以上である
    # 6. BとCは異なる文字である
    # 7. AとCはR, G, Bのどれか
    # 8. AとCは異なる文字である
    # 9. BとCは異なる文字である
    # 10. AとBの距離はBとCの距離と異なる
    # 11. AとCの距離はBとCの距離と異なる
    # 1. AとBはR, G, Bのどれか
    # 2. AとB
