def main():
    N, Q = map(int, input().split())
    A = list(map(int, input().split()))
    query = [list(map(int, input().split())) for _ in range(Q)]
    #print(N, Q, A, query)
    #Aの要素をa_1, a_2, ... と前から順に見ていったときに、数 x_i が k_i 回目に登場するのは A の前から何番目の要素を見たときかを出力してください。
    #    ただし条件を満たす要素が存在しない場合は -1 を出力してください。
    #Aの要素をa_1, a_2, ... と前から順に見ていったときに、数 x_i が k_i 回目に登場するのは A の前から何番目の要素を見たときかを出力してください。
    #    ただし条件を満たす要素が存在しない場合は -1 を出力してください。
    #Aの要素をa_1, a_2, ... と前から順に見ていったときに、数 x_i が k_i 回目に登場するのは A の前から何番目の要素を見たときかを出力してください。
    #    ただし条件を満たす要素が存在しない場合は -1 を出力してください。
    #Aの要素をa_1, a_2, ... と前から順に見ていったときに、数 x_i が k_i 回目に登場するのは A の前から何番目の要素を見たときかを出力してください。
    #    ただし条件を満たす要素が存在しない場合は -1 を出力してください。
    #Aの要素をa_1, a_2, ... と前から順に見ていったときに、数 x_i が k_i 回目に登場する

if __name__ == '__main__':
    main()