def main():
    a = int(input())
    b = int(input())
    c = int(input())
    d = int(input())
    e = int(input())
    # 10の倍数の時刻で注文する
    # 10の倍数の時刻で届く
    # 10の倍数の時刻で注文する
    # 10の倍数の時刻で届く
    # 10の倍数の時刻で注文する
    # 10の倍数の時刻で届く
    # 10の倍数の時刻で注文する
    # 10の倍数の時刻で届く
    # 10の倍数の時刻で注文する
    # 10の倍数の時刻で届く
    # 10の倍数の時刻で注文する
    # 10の倍数の時刻で届く
    # 10の倍数の時刻で注文する
    # 10の倍数の時刻で届く
    # 10の倍数の時刻で注文する
    # 10の倍数の時刻で届く
    # 10の倍数の時刻で注文する
    # 10の倍数の時刻で届く
    dish = [a, b, c, d, e]
    dish.sort()
    dish[0] = dish[0] + 10 - dish[0] % 10
    dish[1] = dish[1] + 10 - dish[1] % 10
    dish[2] = dish[2] + 10 - dish[2] % 10
    dish[3] = dish[3] + 10 - dish[3] % 10
    dish[4] = dish[4] + 10 - dish[4] % 10
    print(dish[0] + dish[1] + dish[2] + dish[3] + dish[4])

if __name__ == '__main__':
    main()