def main():
    N = int(input())
    # すぬけ君の情報を入れるリスト
    suzukelist = []
    # 捕まえたすぬけ君の大きさの合計の最大値
    ans = 0
    # 捕まえたすぬけ君の大きさの合計
    sum = 0
    # すぬけ君の情報を入れるリスト
    suzukelist = []
    # 捕まえたすぬけ君の大きさの合計の最大値
    ans = 0
    # 捕まえたすぬけ君の大きさの合計
    sum = 0
    # すぬけ君の情報を入れるリスト
    suzukelist = []
    # 捕まえたすぬけ君の大きさの合計の最大値
    ans = 0
    # 捕まえたすぬけ君の大きさの合計
    sum = 0
    # すぬけ君の情報を入れるリスト
    suzukelist = []
    # 捕まえたすぬけ君の大きさの合計の最大値
    ans = 0
    # 捕まえたすぬけ君の大きさの合計
    sum = 0
    # すぬけ君の情報を入れるリスト
    suzukelist = []
    # 捕まえたすぬけ君の大きさの合計の最大値
    ans = 0
    # 捕まえたすぬけ君の大きさの合計
    sum = 0
    # すぬけ君の情報を入れるリスト
    suzukelist = []
    # 捕まえたすぬけ君の大きさの合計の最大値
    ans =

if __name__ == '__main__':
    main()