def main():
    N = int(input())
    A = list(map(int, input().split()))
    #A = [int(x) for x in input().split()]
    #print(N, A)
    #print(type(N), type(A))
    
    #Aの要素の個数を数える
    #Aの要素の個数が偶数の時は、要素の個数を2で割った値が、Aの中で最も多い個数
    #Aの要素の個数が奇数の時は、要素の個数を2で割った値の1つ大きい値が、Aの中で最も多い個数
    #Aの中で最も多い個数を求める
    
    #Aの要素の個数を数える
    #Aの要素の個数が偶数の時は、要素の個数を2で割った値が、Aの中で最も多い個数
    #Aの要素の個数が奇数の時は、要素の個数を2で割った値の1つ大きい値が、Aの中で最も多い個数
    #Aの中で最も多い個数を求める
    #Aの要素の個数を数える
    #Aの要素の個数が偶数の時は、要素の個数を2で割った値が、Aの中で最も多い個数
    #Aの要素の個数が奇数の時は、要素の個数を2で割った値の1つ大きい値が、Aの中で最も多い個数
    #Aの中で最も多い個数を求める
    #Aの要素の個数を数える
    #Aの要素の個数が偶数の時は、要素の個数を2で割

if __name__ == '__main__':
    main()