def main():
    N, M = map(int, input().split())
    A = [0] * M
    B = [0] * M
    for i in range(M):
        A[i], B[i] = map(int, input().split())
    # print(N, M)
    # print(A)
    # print(B)
    # print('-----')
    # 都市1からスタートして、都市Nにゴールする組み合わせを出す
    # 都市1からスタートして、都市Nにゴールする組み合わせを出す
    # 都市2からスタートして、都市Nにゴールする組み合わせを出す
    # 都市3からスタートして、都市Nにゴールする組み合わせを出す
    # 都市4からスタートして、都市Nにゴールする組み合わせを出す
    # 都市5からスタートして、都市Nにゴールする組み合わせを出す
    # 都市6からスタートして、都市Nにゴールする組み合わせを出す
    # 都市7からスタートして、都市Nにゴールする組み合わせを出す
    # 都市8からスタートして、都市Nにゴールする組み合わせを出す
    # 都市9からスタートして、都市Nにゴールする組み合わせを出す
    # 都市10からスタートして、都市Nにゴールする組み合わせを出す
    # 都市11からスタートして、都市Nにゴールする組み合わせを出す
    # 都市12からスタートして、都市Nにゴールする組み合わせを出す
    # 都市13からスタートして、都市Nにゴールする組み合わせを出す
    #
