def get_max_value(n, grid):
    # 1. 从第一行的第一个开始，每次向右移动一格，到最后一行的第一个
    # 2. 从第一行的第一个开始，每次向右移动一格，到最后一行的倒数第二个
    # 3. 从第一行的第一个开始，每次向右移动一格，到最后一行的倒数第三个
    # 4. 从第一行的第一个开始，每次向右移动一格，到最后一行的倒数第四个
    # 5. 从第一行的第一个开始，每次向右移动一格，到最后一行的倒数第五个
    # 6. 从第一行的第一个开始，每次向右移动一格，到最后一行的倒数第六个
    # 7. 从第一行的第一个开始，每次向右移动一格，到最后一行的倒数第七个
    # 8. 从第一行的第一个开始，每次向右移动一格，到最后一行的倒数第八个
    # 9. 从第一行的第一个开始，每次向右移动一格，到最后一行的倒数第九个
    # 10. 从第一行的第一个开始，每次向右移动一格，到最后一行的倒数第十个
    # 11. 从第一行的第二个开始，每次向右移动一格，到最后一行的第二个
    # 12. 从第一行的第三个开始，每次向右移动一格，到最后一行的第三个
    # 13. 从第一行的第四个开始，每次向右移动一格，到最后一行的第四个
    # 14. 从第一行的第五个开始，每次

if __name__ == '__main__':
    get_max_value()