def solve():
    # h1, h2, h3, w1, w2, w3 = map(int, input().split())
    h1, h2, h3, w1, w2, w3 = 3, 4, 6, 3, 3, 7
    # h1, h2, h3, w1, w2, w3 = 3, 4, 5, 6, 7, 8
    # h1, h2, h3, w1, w2, w3 = 5, 13, 10, 6, 13, 9
    # h1, h2, h3, w1, w2, w3 = 20, 25, 30, 22, 29, 24
    # 1 <= h1, h2, h3, w1, w2, w3 <= 30
    # 3 <= h1, h2, h3, w1, w2, w3 <= 30
    # 縦横 3 × 3 のマス目に、以下の条件をすべて満たすように各マスに正の整数を 1 つずつ書きこむことを考えます。
    # i=1,2,3 について、上から i 行目に書きこんだ数の和が h_i になる。
    # j=1,2,3 について、左から j 列目に書きこんだ数の和が w_j になる。
    # 1 <= h1, h2, h3, w1, w2, w3 <= 30
    # 3 <= h1, h2, h3, w1, w2, w3 <= 30
    # 1 <= h1, h2, h3, w1, w2, w3 <= 30
    # 3 <= h1, h2, h3, w1, w2, w3 <= 30
    # 1 <= h1, h2, h3, w1, w2, w3 <=

if __name__ == '__main__':
    solve()