def main():
    #input
    N, K = map(int,input().split())
    A = list(map(int,input().split()))
    #N, K = 5, 2
    #A = [3, 4, 1, 3, 4]
    #N, K = 5, 3
    #A = [3, 4, 1, 3, 4]
    #N, K = 7, 5
    #A = [1, 2, 3, 4, 5, 5, 10]
    #N, K = 10, 5
    #A = [1, 2, 3, 4, 5, 5, 10, 10, 10, 10]
    #N, K = 10, 5
    #A = [1, 2, 3, 4, 5, 5, 10, 10, 10, 9]
    #N, K = 10, 5
    #A = [1, 2, 3, 4, 5, 5, 10, 10, 10, 11]
    #N, K = 10, 5
    #A = [1, 2, 3, 4, 5, 5, 10, 10, 10, 11]
    #N, K = 10, 5
    #A = [1, 2, 3, 4, 5, 5, 10, 10, 10, 11]
    #N, K = 10, 5
    #A = [1, 2, 3, 4, 5, 5, 10, 10, 10, 11]
    
    #solve
    #1つの数字の位置を固定して、その位置からK個先の数字と入れ替える
    #N-K+1個の数字の位置を固定する
    #その位置からK個先の位置の数字と入れ替える
    #入れ替えると、K個先の数字の位置が固定され

if __name__ == '__main__':
    main()