def main():
    N = int(input())
    A = list(map(int, input().split()))
    # print(N)
    # print(A)
    # 2N+1の配列を作る
    # 0: アメーバ1
    # 1: アメーバ2
    # 2: アメーバ3
    # 3: アメーバ4
    # 4: アメーバ5
    # 5: アメーバ6
    # 6: アメーバ7
    # 7: アメーバ8
    # 8: アメーバ9
    # 9: アメーバ10
    # 10: アメーバ11
    # 11: アメーバ12
    # 12: アメーバ13
    # 13: アメーバ14
    # 14: アメーバ15
    # 15: アメーバ16
    # 16: アメーバ17
    # 17: アメーバ18
    # 18: アメーバ19
    # 19: アメーバ20
    # 20: アメーバ21
    # 21: アメーバ22
    # 22: アメーバ23
    # 23: アメーバ24
    # 24: アメーバ25
    # 25: アメーバ26
    # 26: アメーバ27
    # 27: アメーバ28
    # 28: アメーバ29
    # 29: アメーバ30
    # 30: アメーバ31
    # 31: アメーバ32
    # 32: アメーバ33
    # 33: アメーバ34
    # 34: アメーバ35
    # 35: アメーバ36
    # 36: アメーバ37
    # 37: アメーバ38
    # 38: アメーバ39
    # 39: アメーバ40
    # 40: アメーバ41
    # 41: ア
