def main():
    N = input()
    # Nの文字列の先頭に0を加えても回文になるか
    # 0を加えても回文にならないなら、Nの文字列の末尾に0を加えても回文にならない
    # 0を加えても回文にならないなら、Nの文字列の先頭と末尾にそれぞれ0を加えても回文にならない
    # 0を加えても回文にならないなら、Nの文字列の先頭と末尾にそれぞれ0を加えても回文にならない
    # 0を加えても回文にならないなら、Nの文字列の先頭と末尾にそれぞれ0を加えても回文にならない
    # Nの文字列の先頭に0を加えても回文になるか
    # 0を加えても回文にならないなら、Nの文字列の末尾に0を加えても回文にならない
    # 0を加えても回文にならないなら、Nの文字列の先頭と末尾にそれぞれ0を加えても回文にならない
    # 0を加えても回文にならないなら、Nの文字列の先頭と末尾にそれぞれ0を加えても回文にならない
    # 0を加えても回文にならないなら、Nの文字列の先頭と末尾にそれぞれ0を加えても回文にならない
    # 0を加えても回文にならないなら、Nの文字列の先頭と末尾にそれぞれ0を加えても回文にならない
    #

if __name__ == '__main__':
    main()