def main():
    N, M = map(int, input().split())
    AB = [list(map(int, input().split())) for _ in range(M)]
    #print(N, M)
    #print(AB)
    #print(len(AB))
    #print(len(AB[0]))
    # 頂点の色の組み合わせを全探索
    # 赤:0, 緑:1, 青:2
    # 赤:1, 緑:2, 青:0
    # 赤:2, 緑:0, 青:1
    # 3通り
    # 赤:0, 緑:2, 青:1
    # 赤:1, 緑:0, 青:2
    # 赤:2, 緑:1, 青:0
    # 3通り
    # 3^N通り
    ans = 0
    for i in range(3**N):
        #print(i)
        #print(i//3**0%3, i//3**1%3, i//3**2%3, i//3**3%3, i//3**4%3, i//3**5%3, i//3**6%3, i//3**7%3, i//3**8%3, i//3**9%3)
        #print(i//3**0%3, i//3**1%3, i//3**2%3, i//3**3%3, i//3**4%3, i//3**5%3, i//3**6%3, i//3**7%3, i//3**8%3, i//3**9%3)
        #print(i//3**0%3, i//3**1%3, i//3**2%3, i//3**3%3, i//3**4%3, i//3**5%3, i//3**6%3, i//3**7%3, i//3**8%3, i//3**9%3)
        #print(i//

if __name__ == '__main__':
    main()