def main():
    N, X = map(int, input().split())
    A = [list(map(int, input().split())) for _ in range(N)]
    #print(A) #A[0][1] A[1][1] A[2][1] がそれぞれ最初の袋の2番目のボールの書かれた数
    #print(A[0][1]) #A[0][1] が最初の袋の2番目のボールの書かれた数
    #print(A[1][1]) #A[1][1] が2番目の袋の2番目のボールの書かれた数
    #print(A[2][1]) #A[2][1] が3番目の袋の2番目のボールの書かれた数
    #print(A[0][2]) #A[0][2] が最初の袋の3番目のボールの書かれた数
    #print(A[1][2]) #A[1][2] が2番目の袋の3番目のボールの書かれた数
    #print(A[2][2]) #A[2][2] が3番目の袋の3番目のボールの書かれた数
    #print(A[0][3]) #A[0][3] が最初の袋の4番目のボールの書かれた数
    #print(A[1][3]) #A[1][3] が2番目の袋の4番目のボールの書かれた数
    #print(A[2][3]) #A[2][3] が3番目の袋の4番目のボールの書かれた数
    #print(A[0][4]) #A[0][4] が最初の袋の5番目のボールの書かれた数
    #print(A[1][4]) #A[1][4] が2番目

if __name__ == '__main__':
    main()