def main():
    N = int(input())
    C = list(map(int, input().split()))
    # 1 ≦ A_i ≦ C_i (1 ≦ i ≦ N)
    # A_i ≠ A_j (1 ≦ i < j ≦ N)
    # ただし、答えは非常に大きくなる可能性があるので、(10^9+7) で割った余りを出力してください。
    # 1 ≦ N ≦ 2 × 10^5
    # 1 ≦ C_i ≦ 10^9
    # 入力は全て整数
    # 条件を全て満たす整数列 A の個数を (10^9+7) で割った余りを出力せよ。
    # N = 2
    # C = [1, 3]
    # N = 4
    # C = [3, 3, 4, 4]
    # N = 2
    # C = [1, 1]
    # N = 10
    # C = [999999917, 999999914, 999999923, 999999985, 999999907, 999999965, 999999914, 999999908, 999999951, 999999979]
    # N = 200000
    # C = [999999917, 999999914, 999999923, 999999985, 999999907, 999999965, 999999914, 999999908, 999999951, 999999979]
    # 1 ≦ A_i ≦ C_i (1 ≦ i ≦ N)
    # A_i ≠ A_j (1 ≦ i < j ≦ N)
    # ただし、答えは非常に大きくなる可能性があるので、(10^9+7) で割った余りを出力してください。
    # 1 ≦ N ≦ 2 × 10^5
    # 1 ≦ C_i ≦ 10^9
    # 入力は全て整数

if __name__ == '__main__':
    main()