def main():
    N = int(input())
    A = list(map(int, input().split()))
    # A = [3, 2, 4, 1, 2]
    # N = 5
    # A = [10, 71, 84, 33, 6, 47, 23, 25, 52, 64]
    # N = 10
    # A = [1, 2, 3, 1000000000, 4, 5, 6]
    # N = 7
    # A = [10, 71, 84, 33, 6, 47, 23, 25, 52, 64]
    # N = 10
    # A = [1, 2, 3, 1000000000, 4, 5, 6]
    # N = 7
    # N = int(input())
    # A = list(map(int, input().split()))
    # 1. 1つ目の切り口を固定する
    # 2. 2つ目の切り口を固定する
    # 3. 3つ目の切り口を固定する
    # 4. 4つ目の切り口を固定する
    # 5. 1,2,3,4を繰り返す
    # 1. 1つ目の切り口を固定する
    # 2. 2つ目の切り口を固定する
    # 3. 3つ目の切り口を固定する
    # 4. 4つ目の切り口を固定する
    # 5. 1,2,3,4を繰り返す
    # 1. 1つ目の切り口を固定する
    # 2. 2つ目の切り口を固定する
    # 3. 3つ目の切り口を固定する
    # 4. 4つ目の切り口を固定する
