def main():
    # 4頂点全てにポーンが置いてある正方形の数を求める
    # 1 以上 9 以下の整数 r,c について、S_{r} の c 番目の文字が # であるとき座標 (r,c) にポーンが置いてあり、S_{r} の c 番目の文字が . であるとき座標 (r,c) に何も置かれていません。
    # この平面上の正方形であって、4 頂点全てにポーンが置いてあるものの個数を求めてください。
    # S_1,...,S_9 はそれぞれ # と . からなる長さ 9 の文字列
    
    # 1 以上 9 以下の整数 r,c について、S_{r} の c 番目の文字が # であるとき座標 (r,c) にポーンが置いてあり、S_{r} の c 番目の文字が . であるとき座標 (r,c) に何も置かれていません。
    # この平面上の正方形であって、4 頂点全てにポーンが置いてあるものの個数を求めてください。
    # S_1,...,S_9 はそれぞれ # と . からなる長さ 9 の文字列
    
    # 1 以上 9 以下の整数 r,c について、S_{r} の c 番目の文字が # であるとき座標 (r,c) にポーンが置いてあり、S_{r} の c 番目の文字が . であるとき座標 (r,c) に何も置かれていません。
    # この平面

if __name__ == '__main__':
    main()