def main():
    N = int(input())
    A = list(map(int, input().split()))
    #print(N)
    #print(A)
    # 1 <= N <= 359
    # 1 <= A_i <= 359
    # 1 <= N <= 359
    # 1 <= A_i <= 359
    # 同じ場所に複数回切れ込みが入ることはない。
    # 1 <= N <= 359
    # 1 <= A_i <= 359
    # 同じ場所に複数回切れ込みが入ることはない。
    # 1 <= N <= 359
    # 1 <= A_i <= 359
    # 同じ場所に複数回切れ込みが入ることはない。
    # 1 <= N <= 359
    # 1 <= A_i <= 359
    # 同じ場所に複数回切れ込みが入ることはない。
    # 1 <= N <= 359
    # 1 <= A_i <= 359
    # 同じ場所に複数回切れ込みが入ることはない。
    # 1 <= N <= 359
    # 1 <= A_i <= 359
    # 同じ場所に複数回切れ込みが入ることはない。
    # 1 <= N <= 359
    # 1 <= A_i <= 359
    # 同じ場所に複数回切れ込みが入ることはない。
    # 1 <= N <= 359
    # 1 <= A_i <= 359
    # 同じ場所に複数回切れ込みが入ることはない。
    # 1 <= N <= 359
    # 1 <= A_i <= 359
    # 同じ場所に複数回切れ込みが入ることはない。
    # 1 <= N <= 359
