def main():
    #入力
    N, M = map(int, input().split())
    #約数を求める
    divisors = []
    for i in range(1, int(M**0.5)+1):
        if M % i == 0:
            divisors.append(i)
            if i != M // i:
                divisors.append(M // i)
    #約数の個数
    l = len(divisors)
    #約数に対して、N個の要素を選ぶ組み合わせの数を求める
    #組み合わせの数は、N!/(i!*(N-i)!)で求める
    #iは、divisorsの要素の約数の個数
    #ex) 6 = 1*2*3
    #    12 = 1*2*2*3
    #    24 = 1*2*2*2*3
    #    36 = 1*2*3*3
    #    48 = 1*2*2*2*2*3
    #    60 = 1*2*2*3*5
    #    72 = 1*2*2*2*3*3
    #    84 = 1*2*3*7
    #    96 = 1*2*2*2*2*2*3
    #    108 = 1*2*2*3*3*3
    #    120 = 1*2*2*2*3*5
    #    132 = 1*2*3*11
    #    144 = 1*2*2*2*2*2*2*3
    #    156 = 1*2*2*3*13
    #    168 = 1*2*2*2*3*7
    #    180 = 1*2*2*3*5*3
    #    192 = 1*2*2*2*2*2*2*2*3
    #    204 = 1*2*3*
