def main():
    N = int(input())
    x = [0] * N
    y = [0] * N
    p = [0] * N
    for i in range(N):
        x[i], y[i], p[i] = map(int, input().split())
    # 二分探索で回数を求める
    def is_ok(arg):
        # 条件を満たすかどうか？問題ごとに定義
        # 二分探索の対象となる配列は、必ずソートされている必要がある
        # 今回の場合、arg回訓練を行った時に、どのジャンプ台からどのジャンプ台に移動できるかを求める
        # そのため、arg回訓練を行った時に、どのジャンプ台からどのジャンプ台に移動できるかを求める
        # そのため、arg回訓練を行った時に、どのジャンプ台からどのジャンプ台に移動できるかを求める
        # そのため、arg回訓練を行った時に、どのジャンプ台からどのジャンプ台に移動できるかを求める
        # そのため、arg回訓練を行った時に、どのジャンプ台からどのジャンプ台に移動できるかを求める
        # そのため、arg回訓練を行った時に、どのジャンプ台からどのジャンプ台に移動できるかを求める
        # そのため、arg回訓練を行った時に、どのジャンプ台からどのジャンプ台に移動できるかを求める
        # そのため、arg回訓練を行った時に

if __name__ == '__main__':
    main()