def solve(n):
    # 1 以上 N 以下の整数のうち、 2 以上の整数 a, b を用いて a^b と表せないものはいくつあるでしょうか？
    # 1 は 2 以上の整数 a, b を用いて a^b と表せないので、答えは 1 です。
    # 2 は 2 以上の整数 a, b を用いて a^b と表せないので、答えは 2 です。
    # 3 は 2 以上の整数 a, b を用いて a^b と表せないので、答えは 3 です。
    # 4 は 2 以上の整数 a, b を用いて a^b と表せるので、答えは 3 です。
    # 5 は 2 以上の整数 a, b を用いて a^b と表せないので、答えは 4 です。
    # 6 は 2 以上の整数 a, b を用いて a^b と表せるので、答えは 4 です。
    # 7 は 2 以上の整数 a, b を用いて a^b と表せないので、答えは 5 です。
    # 8 は 2 以上の整数 a, b を用いて a^b と表せるので、答えは 5 です。
    # 9 は 2 以上の整数 a, b を用いて a^b と表せるので、答えは 5 です。
    # 10 は 2 以上の整数 a, b を用いて a^b と表せるので、答えは 5 です。
    # 11 は 2 以上の整数 a, b を用いて a^b と表せないので、答えは 6

if __name__ == '__main__':
    solve()