def main():
    n, k = map(int, input().split())
    # k個の青いボールを回収するために高橋君がちょうど i 回操作をする必要があるボールの並べ方の総数
    # 1 ≤ i ≤ K
    # 1個の青いボールを回収するために高橋君がちょうど 1 回操作をする必要があるボールの並べ方は何通りあるでしょうか。
    # 1個の青いボールを回収するために高橋君がちょうど 2 回操作をする必要があるボールの並べ方は何通りあるでしょうか。
    # 1個の青いボールを回収するために高橋君がちょうど 3 回操作をする必要があるボールの並べ方は何通りあるでしょうか。
    # 1個の青いボールを回収するために高橋君がちょうど 4 回操作をする必要があるボールの並べ方は何通りあるでしょうか。
    # 1個の青いボールを回収するために高橋君がちょうど 5 回操作をする必要があるボールの並べ方は何通りあるでしょうか。
    # 1個の青いボールを回収するために高橋君がちょうど 6 回操作をする必要があるボールの並べ方は何通りあるでしょうか。
    # 1個の青いボールを回収

if __name__ == '__main__':
    main()