def main():
    #入力
    N,Q = map(int,input().split())
    A = list(map(int,input().split()))
    X = [int(input()) for _ in range(Q)]
    #print(N,Q,A,X)
    
    #Aの要素を全てXにする時、必要な「操作」の最小回数を求める
    #A_i に 1 を加算する。
    #A_i から 1 を減算する。
    #A_i を 2 で割る。
    #A_i に 2 を乗算する。
    #A_i に 1 を加算する。
    #A_i から 1 を減算する。
    #A_i を 2 で割る。
    #A_i に 2 を乗算する。
    #A_i に 1 を加算する。
    #A_i から 1 を減算する。
    #A_i を 2 で割る。
    #A_i に 2 を乗算する。
    #A_i に 1 を加算する。
    #A_i から 1 を減算する。
    #A_i を 2 で割る。
    #A_i に 2 を乗算する。
    #A_i に 1 を加算する。
    #A_i から 1 を減算する。
    #A_i を 2 で割る。
    #A_i に 2 を乗算する。
    #A_i に 1 を加算する。
    #A_i から 1 を減算する。
    #A_i を 2 で割る。
    #A_i に 2 を乗算する。
    #A_i に 1 を加算する。
    #A_i から 1 を減算する。
    #A_i を 2 で割る。
    #A_i に 2 を乗算する。
    #A_i に 1 を加算する。
    #A_i から 1 を減算する。
    #A_i を 2 で割る。
    #A

if __name__ == '__main__':
    main()