def main():
    N, K = map(int, input().split())
    MOD = 10 ** 9 + 7
    # K個の青いボールとN-K個の赤いボールがあります。
    # すぬけ君と高橋君はこれらのボールで遊んでいます。
    # 高橋君は、1 回の操作で連続して並ぶ青いボールを何個でも回収することができます。
    # 高橋君は、常に K 個の青いボールを回収するのにかかる操作の回数が最小になるように行動します。
    # 高橋君は、常に K 個の青いボールを回収するのにかかる操作の回数が最小になるように行動します。
    # K個の青いボールを回収するために高橋君がちょうどi回操作をする必要があるボールの並べ方は何通りあるでしょうか。
    # 1 ≤ i ≤ K をみたす i それぞれについて答えを計算し、 10^9+7 で割った余りを答えてください。
    # N個のボールを左から右に一列に並べます。
    # これらのうち K 個の青いボールのみを回収します。
    # K個の青いボールを回収するために高橋君がちょうどi回操作をする必要があるボールの並べ方は何通りあるでしょうか。
    # N個のボールを左から右に一列に並べます。
    # これらのうち K 個の青
